MasterCase/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (50 0 0);
pressure             0;
turbulentKE          1.5; //0.24 for 20
turbulentOmega       44.72; //1.78 for 20

// ************************************************************************* //
