MasterCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    lowerWall
    {
        type            zeroGradient;
    }
    
    upperWall
    {
        type            zeroGradient;
    }

    tire_wall
    {
        type            zeroGradient;
    }

    rim_wall
    {
        type            zeroGradient;
    }

    plane_wall
    {
        type            zeroGradient;
    }

    rad_wall
    {
        type            zeroGradient;
    }

    symWall
    {
        type        symmetry;
    }

    left
    {
        type        zeroGradient;
    }
}

// ************************************************************************* //
